In [1]:
import pandas as pd

## Series Any Column

In [2]:
s1 = pd.Series([10,20,30])
s2 = pd.Series({"A":"Jayant","B":21,})

In [10]:
s1

0    10
1    20
2    30
dtype: int64

In [11]:
s2

A    Jayant
B        21
dtype: object

## Data Frame

In [7]:
d1 = pd.DataFrame([1,2,3,4],columns=["Number"])
d2 = pd.DataFrame({
  "Age":[23,45,67],
  "Sallary":[2000,4999,5999],
})

In [8]:
d1

   Number
0       1
1       2
2       3
3       4

In [9]:
d2

   Age  Sallary
0   23     2000
1   45     4999
2   67     5999

In [15]:
s1 = pd.Series([10,20,30])
s2 = pd.Series([20,40,60])

In [16]:
df = pd.DataFrame({"c1":s1,"c2":s2})
df

   c1  c2
0  10  20
1  20  40
2  30  60